const mamlaNames = [
  "সার্টিফিকেট আপিল", "নামজারি আপিল", "নামজারি রিভিশন", "পিটিশন", "বিবিধ সংশোধনী রিভিশন",
  "মিচ আপিল", "উচ্ছেদ আপিল", "মিচ রিভিশন", "নামজারি জমাভাগ আপিল", "নামজারি জমাখারিজ আপিল",
  "নামজারি রিভিউ আপিল", "নামজারি জমাভাগ রিভিশন", "হোল্ডিং আপিল", "বিবিধ আপিল",
  "সার্টিফিকেট রিভিশন", "ভিপি আপিল", "নামজরি রিভিশন", "নামজারি মিচ আপিল", "বন্দোবস্তি রিভিশন",
  "রিভিশন মিচ আপিল", "নামজারি জমাখারিজ রিভিশন", "মিচ এল আপিল", "নামজারি বিবিধ আপিল",
  "অবমূল্যায়ন আপিল", "বিবিধ রিভিশন", "নামজারি জমাঃ আপিল", "বিবিধ রেকড সংশোধনী আপিল",
  "বন্দোবস্তি আপিল", "নামজারি রিভিউ", "জমাভাগ রিভিশন", "নামজারি মিচ রিভিশন",
  "বিবিধ নামজারি আপিল", "ভি.পি আপিল", "বাজার ফান্ড মিচ আপিল", "এল এ মিচ আপিল",
  "বাজার ফান্ড বন্দোবস্ত আপিল", "জোত: পূনবহাল রিভিশন", "মিউটেশন রিভিশন", "মিউটেশন আপিল",
  "জমাখারিজ রিভিশন", "বন্দোবস্তি মামলা", "জলমহাল আপিল", "বন্দোবস্ত রিভিশন",
  "চান্দিনা পেরিফেরি মিচ রিভিশন", "সায়রাত আপিল", "এস.এ. মিচ রিভিশন",
  "নামজারি ও জমাখারিজ আপিল", "জমাখারিজ আপিল", "নামজারি আপিল রিভিশন", "আপিল",
  "নামজারি জমাভাগ মিচ রিভিশন", "নামজারি ও জমাভাগ রিভিশন", "বিবিধ মিচ আপিল",
  "সাটির্ফিকেট রিভিশন", "নামজারি রিভিউ মিচ মামলা", "সিভিল আপিল", "রিভিউ পিটিশন",
  "রিভিউ মিচ মামলা", "রিভিশন",
];
import { motion } from "framer-motion"; // For animation

export default function History() {
  return (
    <div className=" mx-auto ">
      <div className="card bg-base-100 shadow-md">
        <div className="card-body">
          <h2 className="card-title text-2xl text-[#004080] font-semibold">
            অতিরিক্ত বিভাগীয় কমিশনার (রাজস্ব) আদালতের ইতিহাস
          </h2>
          <p className="text-gray-700 leading-relaxed mt-2">
            অতিরিক্ত বিভাগীয় কমিশনার (রাজস্ব) এর আদালত ভূমি সংক্রান্ত বিভিন্ন প্রকার আপিল, রিভিশন ও পিটিশন মামলা শুনানি করে থাকেন। নামজারি, জমাভাগ, উচ্ছেদ, বন্দোবস্ত, সার্টিফিকেট মামলা ইত্যাদি সহ নানা ভূমি সংক্রান্ত বিষয় এই আদালতে নিষ্পত্তি হয়। এ আদালত ভূমি অধিকার রক্ষা ও প্রশাসনিক স্বচ্ছতা নিশ্চিত করতে গুরুত্বপূর্ণ ভূমিকা পালন করে।
          </p>

 <motion.div
      initial={{ opacity: 0, y: 30 }}
      animate={{ opacity: 1, y: 0 }}
      transition={{ duration: 0.6 }}
      className="p-6  mx-auto  bg-white shadow-xl rounded-2xl"
    >
          <div className="mt-6">
            <h3 className="text-lg font-bold mb-2 text-gray-800">আদালতে নিষ্পত্তিকৃত মামলার প্রকারভেদ:</h3>
            <div className="h-64 overflow-y-auto p-2 border border-base-200 rounded-md bg-base-100">
              <div className="flex flex-wrap gap-2">
                {mamlaNames.map((name, idx) => (
                  <span key={idx} className="badge badge-outline badge-info border-[#004080] text-sm">
                    {name}
                  </span>
                ))}
              </div>
            </div>
          </div>
</motion.div>

        </div>
      </div>
    </div>
  );
}
